[
    {
        "title": "Software Engineer",
        "timePeriod": "January 2023 - July 2023",
        "company": "Zmanda, BETSOL",
        "description": [
            "Excelled as a full-stack developer at Zmanda, working on design, development and maintenance of pivotal features, services and proof of concepts using Django, React JS and Bash.",
            "Successfully resolved numerous critical production bugs with exceptional efficiency, minimizing downtime and ensuring product stability.",
            "Contributed to Amanda Community (Open-Source) and Enterprise editions.",
            "Lead the Build and packaging team responsible for building, packaging  and delivering the product. Built Gitlab and jenkins pipelines to build Linux packages for Python, C, Perl, Golang applications.",
            "Developed and executed project plans for several program Increments within the Scaled Agile framework, ensuring alignment with overall project goals and objectives."
        ]
    },
    {
        "title": "Associate Software Engineer",
        "timePeriod": "July 2021 - December 2022",
        "company": "Zmanda, BETSOL",
        "description": [
            "Worked as full stack developer for Zmanda. Developed and maintained monitoring features to monitor critical jobs and workflows on the product.",
            "Designed and worked on multiple Proof of Concepts, including Disaster Recovery and Global Data De-duplication.",
            "Experienced in collaborating with cross-functional teams and working with the technical support team to quickly resolve production bugs reported by a large user base.",
            "Mentored interns to work on various services of the product.",
            "Gained proficiency in various technologies including Python, JavaScript, Bash scripting, React JS, Django framework, Flask, RPM packaging, DEB packaging, and git repository maintenance."
        ]
    },
    {
        "title": "Software Engineer Intern",
        "timePeriod": "March 2021 - June 2021",
        "company": "Zmanda, BETSOL",
        "description": [
            "Worked as a back-end developer intern for Zmanda.",
            "Responsible for designing and implementing critical RESTful APIs utilizing the Django framework.",
            "Successfully created monitoring systems that enabled users to seamlessly monitor all critical jobs within the product."
        ]
    },
    {
        "title": "Data Analysis Intern",
        "timePeriod": "January 2020 - February 2020",
        "company": "National Institute Of Technology, Chennai, India",
        "description": [
            "Analyzed Arctic data, including Sound Speed Profiles, Salinity, Temperature, and Wind Speed, utilizing unsupervised clustering techniques (K-Means, DBSCAN, Agglomerative)",
            "Implemented supervised learning methods to predict vessel movement in the Arctic region through analysis of Sound Speed Profiles.",
            "Utilized visualization techniques to effectively communicate clusters and data point relationships in the analyzed data."
        ]
    }
]